Label Encoding:

it is performed on the nominal data.
Nominal data is such data where there is no connection like o=dog, cow, buffalo, parrot. there is no sequence

ordinal data is where we have a sequence like we have s, xs, xl m

In [2]:
import pandas as pd

we are creating our own custom data frame

In [4]:
df = pd.DataFrame({"name":["wscube","cow","cat","dog","parrot","black"]})
df

     name
0  wscube
1     cow
2     cat
3     dog
4  parrot
5   black

In [6]:
from sklearn.preprocessing import LabelEncoder

we have two method fit and fit_transform.
fit is basically used for only training purpose and after training if we want to encode then we can use transform and with fit_transform we can do both at once

This is basically used when we are building model and deploying so at that moment we need encoding.

when we get the trainign model we use together

In [9]:
le = LabelEncoder()
df["en_name"]=le.fit_transform(df["name"])
df

     name  en_name
0  wscube        5
1     cow        2
2     cat        1
3     dog        3
4  parrot        4
5   black        0

In [12]:
dataset = pd.read_csv("../Data/loan_data.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [20]:
dataset["Property_Area"].unique()

array([2, 0, 1])

property_area has 3 values so for that we can use the labelencoder, urban, rural and semiurban

In [19]:
la = LabelEncoder()
la.fit(dataset["Property_Area"])
dataset["Property_Area"]=la.transform(dataset["Property_Area"])
dataset

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,2,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,0,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,2,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,2,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,2,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,0,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,0,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,2,Y
612,LP002984,Male,NaN,2,Graduate,No,7583,0.0,187.0,360.0,1.0,2,Y
613,LP002990,NaN,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,1,N